Revit 2027 API
IExportContext.OnViewEnd Method
 This method marks the end of a 3D view being exported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void OnViewEnd(
	ElementId elementId
)
Sub OnViewEnd (
	elementId As ElementId
)
void OnViewEnd(
	ElementId^ elementId
)
abstract OnViewEnd :
        elementId : ElementId -> unit
Parameters
elementId ElementId
 The Id of the 3D view that has just been processed.
See Also
Reference
IExportContext Interface
Autodesk.Revit.DB Namespace